# Sources
tap 'buo/cask-upgrade'

# Utilities
brew 'brotli'
brew 'composer'
brew 'dnsmasq'
brew 'git'
brew 'httpd'
brew 'mackup'
brew 'mas'
brew 'mysql'
brew 'node'
brew 'php'
brew 'python'
brew 'redis'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Apps from "Web"
cask '1password'
cask 'adguard'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'bartender'
cask 'deezer'
cask 'figma'
cask 'flume'
cask 'insomnia'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'phpstorm'
cask 'sip'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram'
cask 'webstorm'

# Apps from "App Store"
mas 'Bear', id: 1091189122
mas 'Magnet', id: 441258766
mas 'Spark', id: 1176895641
mas 'WinZip', id: 583827028
