# OCD HITS: EVERYTHING SORTED IN ALPHABETICAL ORDER!

# Sources
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'

# Utilities
brew 'composer'
brew 'dnsmasq'
brew 'git'
brew 'httpd'
brew 'mas'
brew 'mysql'
brew 'node'
brew 'php@7.2'
# brew 'python3'
brew 'redis'
# brew 'sqlite'
brew 'yarn'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Apps from "Web"
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'authy'
cask 'bartender'
cask 'droplr'
# cask 'expressvpn'
# cask 'firefox'
cask 'flume'
# cask 'gitkraken'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2-nightly'
cask 'keepingyouawake'
cask 'lunar'
# cask 'opera'
cask 'postman'
# cask 'razer-synapse'
cask 'screenflow'
cask 'sequel-pro'
cask 'sip'
cask 'skype'
# cask 'slack'
cask 'spotify'
cask 'sublime-text-dev'
# cask 'teamviewer'
# cask 'timing'
# cask 'transmission'
cask 'transmit'
# cask 'vlc'

# Apps from "App Store"
# mas 'Affinity Photo', id: 824183456
# mas 'Affinity Designer', id: 824171161
mas 'Airmail 3', id: 918858936
mas 'Bear', id: 1091189122
mas 'Folx GO', id: 736584830
mas 'iA Writer', id: 775737590
mas 'Magnet', id: 441258766
mas 'Medis', id: 1063631769
mas 'Paste', id: 967805235
mas 'WinZip', id: 583827028
