# OCD HITS: EVERYTHING SORTED IN ALPHABETICAL ORDER!

# Sources
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'

# Utilities
brew 'composer'
brew 'dnsmasq'
brew 'git'
brew 'httpd24', args: ['with-privileged-ports', 'with-http2']
brew 'mas'
brew 'mysql'
brew 'node'
brew 'php71', args: ['with-httpd24']
brew 'php71-mcrypt'
brew 'php71-xdebug'
brew 'python3'
brew 'redis'
brew 'sqlite'
brew 'unrar'
brew 'yarn'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Apps from "Web"
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'authy'
cask 'bartender'
cask 'droplr'
cask 'expressvpn'
cask 'flume'
# cask 'fontbase'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2-nightly'
cask 'keepingyouawake'
cask 'postman'
cask 'screenflow'
cask 'sip'
cask 'skype'
cask 'sublime-text'
cask 'sequel-pro'
# cask 'vlc'

# Apps from "App Store"
mas '1Password', id: 443987910
# mas 'Affinity Photo', id: 824183456
# mas 'Affinity Designer', id: 824171161
mas 'Airmail 3', id: 918858936
mas 'Bear', id: 1091189122
mas 'Folx GO', id: 736584830
mas 'Hourly News', id: 579454852
mas 'iA Writer', id: 775737590
mas 'Magnet', id: 441258766
mas 'Medis', id: 1063631769
mas 'Paste', id: 967805235
mas 'Transmit', id: 403388562
mas 'WinZip', id: 583827028
